Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Using C<\G> without C</g> on a target string that has not previously had a C</g> match applied to it is the same as using the C<\A> assertion to match the beginning of the string.
es_es: Usando C<\G> sin C</g> en una cadena objetivo que no haya tenido anteriormente aplicada una coincidencia C</g> es lo mismo que usar la aserción C<\A> para que coincida con el principio de la cadena.

source: Binary "x" is the repetition operator.
es_es: Binario "x" es el operador de repetición.

source: return (wantarray ? (undef, $errmsg) : undef) if $they_blew_it;
es_es: return (wantarray ? (undef, $errmsg) : undef) if $lo_hizo_estallar;

source: This is similar to single quoted strings except that backslashes have no special meaning, with C<\\> being treated as two backslashes and not one as they would in every other quoting construct.
es_es: Esto es similar a las cadenas con comillas simples, excepto que las barras invertidas no tienen ningún significado especial, siendo entonces que C<\\> es tratado como dos barras invertidas y no una como lo harían en cualquier otra construcción entrecomillada.

source: green chile
es_es: chile verde

source: 11 blksz POSIX:: 3..9 only @_ subroutine args
es_es: 11 blksz POSIX:: 3..9 solo @_ args subrutina

source: The next section details more changes brought to the semantics to the smart match operator, that naturally also modify the behaviour of the switch statements where smart matching is implicitly used.
es_es: La próxima sección detalla más cambios introducidos en la semántica del operador de coincidencia inteligente, que, naturalmente, también modifica el comportamiento de las instrucciones switch donde se utilice de forma implícita la coincidencia inteligente.

source: There are also some non-standard modules that provide faster implementations via external C libraries.
es_es: También hay algunos módulos no estándares que ofrecen implementaciones más rápidas a través de bibliotecas de C externas.

source: The C<goto>-&NAME form is highly magical, and substitutes a call to the named subroutine for the currently running subroutine.
es_es: La forma C<goto>-&NOMBRE es muy mágica, y sustituye a una llamada a una subrutina con nombre desde la actual subrutina que se está ejecutando.

source: later version, or
es_es: versión posterior, o

source: If the input string is longer than needed, extra characters are ignored.
es_es: Si la cadena de entrada es más larga de lo necesario, los caracteres sobrantes se ignoran.

source: @articles = sort {$FooPack::b <=> $FooPack::a} @files;
es_es: @articulos = sort {$FooPack::b <=> $FooPack::a} @archivos;

source: $line = <>;
es_es: $linea = <>;

source: perlvar Perl predefined variables
es_es: perlvar Variables predefinidas

source: $elem *= 2;
es_es: $elemento *= 2;

source: Here are some variants, most of which don't work:
es_es: Aquí hay algunas variantes más, la mayoría de los cuales tampoco funcionan:

source: These days, it's considered cleaner to call the internal function directly as C<glob($foo)>, which is probably the right way to have done it in the first place.) For example:
es_es: En estos días, se considera más limpio llamar a la función interna directamente como C<glob($foo)>, que es probablemente la forma correcta de haberlo hecho desde el principio) Por ejemplo:

source: There are web archives of the mailing list at:
es_es: Hay archivos web de la lista de correo en:

source: =head2 Converters
es_es: =head2 Conversores

source: If you want it to match the minimum number of times possible, follow the quantifier with a "?".
es_es: Si desea que coincida con el mínimo número de veces posible, siga el cuantificador con un "?".

source: Specifying VERSION as a literal of the form v5.6.1 should generally be avoided, because it leads to misleading error messages under earlier versions of Perl (that is, prior to 5.6.0) that do not support this syntax.
es_es: Especificando VERSIÓN como un literal de la forma v5.6.1, debe, generalmente, evitarse, porque lleva a crear mensajes de error equívocos en las versiones anteriores de Perl (esto es, anteriores a 5.6.0) que no admiten esta sintaxis.

source: (?{ $cnt = 0 }) # Initialize $cnt.
es_es: (?{ $cnt = 0 }) # Inicializa $cnt.

source: Searches a string for a pattern, and if found, replaces that pattern with the replacement text and returns the number of substitutions made.
es_es: Busca un patrón en una cadena, y si se encuentra, sustituye este patrón con el texto de reemplazo y devuelve el número de sustituciones.

source: The C<print> is more efficient and less error prone.
es_es: El C<print> es más eficiente y menos propenso a errores.

source: -b File is a block special file.
es_es: -b Archivo es un archivo especial por bloques.

source: =head2 "safe signals" optimization
es_es: =head2 Optimización de "señales de seguridad"

source: Scripts which happen to rely on previously erroneous behaviour will consider these fixes as incompatible changes :-) You are advised to perform sufficient acceptance testing on this release to satisfy yourself that this does not affect you, before putting this release into production.
es_es: Scripts que puedan depender de conductas erróneas previas deberán tener en cuenta estas correcciones como cambios incompatibles :-) Se recomienda realizar pruebas de aceptación suficientes para esta versión para estar seguro de que esto no les afecta, antes de poner esa versión en producción.

source: my $count = 0;
es_es: my $cuenta = 0;

source: There are several I/O operators you should know about.
es_es: Hay varios operadores de E/S que debe conocer.

source: For Haiku specific problems contact the HaikuPorts developers: L<http://ports.haiku-files.org/>
es_es: Para problemas específicos de Haiku, póngase en contacto con los desarrolladores HaikuPorts: L<http://ports.haiku-files.org/>

source: If the last element of LIST does not end in a newline, it appends the same file/line number text as C<die> does.
es_es: Si el último elemento de LISTA no termina en un salto de línea, se añade el archivo/número de línea de texto igual como lo hace C<die>.

source: You can say
es_es: Se puede decir

source: perlcheat - Perl 5 Cheat Sheet
es_es: perlcheat - Hoja resumen de Perl 5

source: Nicholas Clark <nick@ccl4.org>, collating wisdom supplied by Slaven Rezic and Tim Bunce.
es_es: Nicholas Clark <nick@ccl4.org>, recopilando la sabiduría proporcionada por Slaven Rezic y Tim Bunce.

source: printf '<%#o>', 12; # prints "<014>"
es_es: printf '<%#o>', 12; # imprime "<014>"

source: The result of evaluation is considered a regular expression and matched as if it were inserted instead of this construct.
es_es: El resultado de la evaluación es considerada como una expresión regular y combinada como si fuera insertada en lugar de esta construcción.

source: C<\E>) are useful when interpolating strings into regular expressions, because by default an interpolated variable will be considered a mini-regular expression.
es_es: C<\E>) son útiles cuando se interpolan cadenas en expresiones regulares, porque por defecto una variable interpolada será considerada una mini expresión regular.

source: This modifier is useful for people who only incidentally use Unicode.
es_es: Este modificador es útil para personas que usan, solo de forma accidental, Unicode.

source: The only question is whether it saves you more time than it took to build the linked list in the first place.
es_es: La única pregunta es si ahorra más tiempo que en lo que se tardó en construir la lista enlazada, al principio.

source: # expand variables in $_, but dynamics only, using
es_es: # expandir variables en $_, pero solo dinámicamente, usando

source: They are package globals.
es_es: Son variables globales del paquete.

source: when (/apples?/) { print "I like apples."
es_es: when (/manzanas?/) { print "Me gustan las manzanas."

# print "Scalars begin with a $variables->{'scalar'}->{'sigil'} ";
source: print "Scalars begin with a $variables->{'scalar'}->{'sigil'}\n";
es_es: print "Los escalares empiezan por $variables->{'scalar'}->{'sigilo'}\n";

source: For date and time processing look at the many related modules on CPAN.
es_es: Para el procesado de fechas y tiempos mire en los módulos relaccionados en CPAN.

source: =item state TYPE EXPR
es_es: =item state TIPO EXPR

source: C<ExtUtils::CBuilder> and C<ExtUtils::ParseXS> have been added.
es_es: Han sido añadidos C<ExtUtils::CBuilder> y C<ExtUtils::ParseXS>.

source: $a =~ s/foo/bar/g; # replaces ALL INSTANCES of foo with bar in $a
es_es: $a =~ s/foo/bar/g; # reemplaza todas las coincidencias de foo por bar en $a

source: =head2 Where can I get a list of Larry Wall witticisms?
es_es: =head2 ¿Dónde puedo obtener una lista de citas ingeniosas de Larry Wall?

source: Likewise any object destructors that need to be called are called before the real exit.
es_es: Igualmente cualquier destructor de objetos que necesite ser llamado es llamado antes de la salida real.

source: $foo = $bar =~ s/this/that/r; # Same as above using /r
es_es: $foo = $bar =~ s/este/aquel/r; # Lo mismo que antes usando /r

source: =head2 Assignment to C<$0> sets the legacy process name with C<prctl()> on Linux
es_es: =head2 Asignación a C<$0> establece el nombre del proceso con C<prctl()> en Linux

source: $is_directory = S_ISDIR($mode);
es_es: $es_directorio = S_ISDIR($modo);

source: The forms C<(?'NAME'pattern)> and C<< (?<NAME>pattern) >> are equivalent.
es_es: Las formas C<(?'NOMBRE'patrón)> y C<< (?<NOMBRE>patrón) >> son equivalentes.

source: You can refer to identifiers in other packages than the current one by prefixing the identifier with the package name and a double colon, as in C<$SomePack::var> or C<ThatPack::INPUT_HANDLE>.
es_es: Puede hacer referencia a los identificadores de otros paquetes distintos del actual anteponiendo el identificador con el nombre del paquete y un dos puntos doble, como en C<$AlgunPaquete::var> o C<EstePaquete::CONTROLADOR_ENTRADA>.

source: In some systems the $quota field may be $change or $age, fields that have to do with password aging.
es_es: En algunos sistemas el campo $cuota puede ser $cambio o $edad, campos que tienen que ver con la caducidad de la contraseña.

source: That is exactly equivalent to
es_es: Eso es exactamente equivalente a

source: Some encodings, like the C<iso-8859> ("latin") range, do not support the full Unicode standard; characters that can't be represented are lost in the conversion.
es_es: Algunas codificaciones, como las de la familia C<iso-8859> ("alfabeto latino"), no cubren el estándar Unicode completo; los caracteres que no se pueden representar se perderán durante la conversión.

source: Backslashed characters are either replaced with corresponding literal strings (as with C<\{>), or else they generate special nodes in the finite automaton (as with C<\b>).
es_es: Los caracteres escapados con contrabarra son sustituidos por sus correspondientes cadenas de texto literales (como en C<\{>), o sino generan nodos especiales en el autómata finito (como en C<\b>).

source: In the particular test case a C<system("perl -e 0")> flushes the stdout pipe of another child process.
es_es: En el caso particular del test C<system("perl -e 0")> vacía la tubería de salida estándar de otro proceso hijo.

source: In some cases perfection has been sacrificed in the goal of getting the general idea across.
es_es: En algunos casos se ha sacrificado la precisión para transmitir la idea general.

source: OPTVAL might either be a packed string or an integer.
es_es: OPCIÓN_VALOR podría ser una cadena empaquetada o un entero.

source: B<NOTE:> In order to make things easier for programmers with experience with the Python or PCRE regex engines the pattern C<< (?P>NAME) >> may be used instead of C<< (?&NAME) >>.
es_es: B<NOTA:> Con el fin de facilitar las cosas a los programadores con experiencia en Python o motores regex PCRE, el patrón C<< (?P>NOMBRE) >> puede ser usado en lugar de C<< (?&NOMBRE) >>.

source: This is now fixed.
es_es: Esto ha sido arreglado.

source: Its effect used to be global.
es_es: Su efecto solía ser global.

source: NOTE: Some sites have redefined the way uname works, and if yours does this, special steps must be taken so that Configure can recognize your system as a UTS system.
es_es: NOTE: Algunos sitios han redefinido la forma en que uname funciona, y si en el suyo lo hace así, se debe tener en cuenta una serie de pasos especiales, para que el Configure puede reconocer su sistema como un sistema UTS.

source: See L<feature> and L<perlsyn/"Switch statements"> for more information.
es_es: Vea L<feature> y L<perlsyn/"Instrucciones switch"> para más información.

source: The text copied gets delimiter-independent.
es_es: El texto copiado es independiente de los delimitadores.

source: These examples often reflect the style and preference of the author of that piece of the documentation, and may be briefer than a corresponding line of code in a real program.
es_es: Los ejemplos de las distintas partes de la documentación reflejan el estilo y las preferencias de sus autores, y pueden ser más escuetos que una línea de código equivalente en un programa real.

source: See also L<DB_File> for other flock() examples.
es_es: Ver también L<DB_File> para otros ejemplos de flock().

source: sub invalid { die "/$_[0]/: invalid escape '\\$_[1]'"}
es_es: sub invalido { die "/$_[0]/: escape inválido '\\$_[1]'"}

source: Perl regexps also support backreferences, lookaheads, and all kinds of other complex details.
es_es: Las expresiones regulares de Perl también ofrecen referencias a capturas previas, inspección hacia adelante, y muchas otras funcionalidades complejas.

source: =item sysread FILEHANDLE,SCALAR,LENGTH
es_es: =item sysread IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD

source: go_outside() and play() unless $is_raining;
es_es: vete_fuera() and juega() unless $este_lloviendo;

source: $key = getc(STDIN);
es_es: $tecla = getc(STDIN);

source: Check your control flow.
es_es: Compruebe su control de flujo.

source: The value of the expression (which is itself determined within scalar context) is first parsed, and if there were no errors, executed in the lexical context of the current Perl program, so that any variable settings or subroutine and format definitions remain afterwards.
es_es: El valor de la expresión (que es en sí mismo determinada en contexto escalar) es primero interpretada, y si no hay ningún error, ejecutada en el contexto léxico del actual programa Perl, por lo que se mantienen después los valores de las variables o definiciones de subrutinas o formatos.

source: open(STDIN, "<&SPLAT") || die "can't dupe SPLAT: $!";
es_es: open(STDIN, "<&SPLAT") || die "no puedo duplicar SPLAT: $!";

source: Names that start with a letter or underscore may also contain digits and underscores.
es_es: Los nombres que empiezan por una letra o el símbolo de subrayado pueden incluir también dígitos y subrayados.

source: If the word C<while> is replaced by the word C<until>, the sense of the test is reversed, but the conditional is still tested before the first iteration.
es_es: Si la palabra C<while> se reemplaza por la palabra C<until>, el sentido del test se invierte, pero la condición es comprobada siempre antes de la primera iteración.

source: You can avoid the ambiguity by always using C<\g{}> or C<\g> if you mean capturing groups; and for octal constants always using C<\o{}>, or for C<\077> and below, using 3 digits padded with leading zeros, since a leading zero implies an octal constant.
es_es: Puede evitar la ambigüedad usando siempre C<\g{}> o C<\g> si se refiere a los grupos de captura; y para las constantes octales siempre con C<\o{}>, o para C<\077> e inferiores, usando 3 dígitos rellenados con ceros a la izquierda, ya que un cero a la izquierda implica una constante octal.

source: "\x7q" "\x07q" yes
es_es: "\x7q" "\x07q" sí

source: opens the UTF8-encoded file containing Unicode characters; see L<perluniintro>.
es_es: abre el archivo codificado en UTF-8 que contiene caracteres Unicode; vea L<perluniintro>.

source: =cut back to the compiler, nuff of this pod stuff!
es_es: =cut devuelta al compilador, ¡lejos de este material pod!

source: tr{}{} Transliteration no (but see below)
es_es: tr{}{} Transliteración no (pero vea abajo)

source: Also, some special instructions for building Perl with Sun Studio on Linux.
es_es: Además, algunas instrucciones especiales para la construcción de Perl con Sun Studio en Linux.

source: That's because C<.*> was greedy, so you get everything between the I<first> "foo" and the I<last> "bar".
es_es: Esto se debe a que C<.*> era avaricioso, por lo que obtiene todo lo que hay entre el I<primer> "mesa" y el I<último> "come".

source: Like C, Perl does a certain amount of expression evaluation at compile time whenever it determines that all arguments to an operator are static and have no side effects.
es_es: Al igual que C, Perl hace una cierta cantidad de evaluación de expresiones en tiempo de compilación cuando determina que todos los argumentos a un operador son estáticos y no tienen efectos secundarios.

source: (See also L<Integer Arithmetic>.)
es_es: (Ver también L<Aritmética entera>).

source: # put commas in the right places in an integer
es_es: # pone comas en los lugares adecuados en un entero

source: =head2 PODs: Embedded Documentation X<POD> X<documentation>
es_es: =head2 POD: Documentación embebida X<POD> X<documentación> X<documentación>

source: Perl 5.7.2 (Developmental) or Perl 5.8.x (forthcoming) for UTS
es_es: Perl 5.7.2 (en desarrollo) o Perl 5.8.x (en preparación) para UTS

source: To confirm this, from the main Perl source dir, do:
es_es: Para confirmar esto, desde el directorio principal fuente de Perl, hacer:

source: Such platforms include Mac OS Classic, IBM z/OS (and other EBCDIC platforms), and NetWare.
es_es: En estas plataformas se incluyen a Mac OS Classic, IBM z/OS (y otras plataformas EBCDIC), y NetWare.

source: =head3 Escape sequences
es_es: =head3 Secuencias de Escape

source: There is often a matter of opinion and taste, and there isn't any one answer that fits everyone.
es_es: Esto suele ser una cuestión de opinión y gusto, y no hay una respuesta definitiva para todos.

source: Shifts the first value of the array off and returns it, shortening the array by 1 and moving everything down.
es_es: Extrae el primer valor del array y lo devuelve, acortando el array en uno y moviendo todos los demás hacia arriba.

source: == != <=> eq ne cmp ~~ for equals foreach (ALWAYS)
es_es: == != <=> eq ne cmp ~~ for igual a foreach (SIEMPRE)

source: See L<perlop/"Quote-Like Operators">.
es_es: Ver L<perlop/"Operadores entrecomillados">.

source: Also see:
es_es: Vea también:

source: =item Verbs that take an argument
es_es: =item Verbos que toman un argumento

source: See L<perlsyn> for alternative strategies.
es_es: Ver L<perlsyn> para estrategias alternativas.

source: # $s is now "The black cat jumped from the green tree"
es_es: # $s es ahora "El gato negro saltó desde el árbol verde"

source: You can even set them to pipe commands.
es_es: Incluso se puede configurar para entubar a comandos.

source: To query options at another level the protocol number of the appropriate protocol controlling the option should be supplied.
es_es: Para consultar opciones en otro nivel se debe indicar el apropiado número de protocolo que controle a esa opción.

source: The implementation of the C3 MRO and switchable MROs within the perl core was written by Brandon L Black.
es_es: La aplicación de la C3 MRO y la capacidad de intercambiar MRO en el núcleo de Perl fue escrito por Brandon L Black.

source: 4 uid 4 month-1 4 hasargs $| autoflush
es_es: 4 uid 4 mes-1 4 hasargs $| volcado automático

source: If this file is found, it will be loaded in place of any file ending in a "F<.pm>" extension.
es_es: Si este archivo es encontrado, se cargará en lugar de cualquier archivo que termine en una extensión "F<.pm>".

source: Works just like index() except that it returns the position of the I<last> occurrence of SUBSTR in STR.
es_es: Funciona igual que index() excepto que devuelve la posición de la I<última> ocurrencia de SUBCADENA en CADENA.

source: See the perlfunc(1) entry on C<umask> for more on this.
es_es: Ver la entrada perlfunc(1) para C<umask> para más información sobre esto.

source: Module::Build should be more reliably pass its tests under cygwin.
es_es: Module::Build debería ser más fiable a la hora de pasar sus test, en cygwin.

source: # ... # other switches
es_es: # ... # otras opciones

source: =head2 Y2038 compliance
es_es: =head2 Cumplimiento Y2038

source: It also means that C<$foo[1]> is a part of @foo, not a part of $foo.
es_es: También significa que C<$foo[1]> es parte de @foo, no parte de $foo.

source: An array can be accessed one scalar at a time by specifying a dollar sign (C<$>), then the name of the array (without the leading C<@>), then the subscript inside square brackets.
es_es: Un array puede ser accedido, un escalar cada vez, especificando un signo dólar (C<$>), seguido por el nombre del array (sin el C<@>), seguido del subíndice entre corchetes.

source: # only on ASCII and ASCII-derived systems such as ISO Latin 1
es_es: # solo en sistemas ASCII y derivados, como ISO Latin 1

source: Bar.pm implements the related BAR protocol."
es_es: Bar.pm implementa el protocolo relacionado BAR."

source: That way you're safe from the shell expanding wildcards or splitting up words with whitespace in them.
es_es: De esta forma estará protegido de la expansión de los comodines del shell o de la división en palabras con un espacio en blanco dentro de ellas.

source: Now you can add new rows.
es_es: Ahora puede agregar nuevas filas.

source: This means that the C<~> and C<~~> tokens treat the entire PICTURE as a single line.
es_es: Esto significa que los tokens C<~> y C<~~> tratan al CUADRO entero como una única línea.

source: If you are upgrading from an earlier release such as 5.10.0, first read L<perl5120delta>, which describes differences between 5.10.0 and 5.12.0.
es_es: Si está actualizando desde una versión anterior como la 5.10.0, primero lea L<perl5120delta>, que describe las diferencias entre 5.10.0 y la 5.12.0.

source: @articles = sort {uc($a) cmp uc($b)} @files;
es_es: @articulos = sort {uc($a) cmp uc($b)} @archivos;

source: =head1 The "Artistic License"
es_es: =head1 La "Licencia Artística"

source: =item getprotobyname NAME
es_es: =item getprotobyname NOMBRE

source: New Maintenance Development
es_es: Nuevo Mantenimiento Desarrollo

source: The value returned depends on the type of thing the reference is a reference to.
es_es: El valor devuelto depende del tipo de cosa que la referencia indique como referencia.

source: In such a case additional elements $evaltext and C<$is_require> are set: C<$is_require> is true if the frame is created by a C<require> or C<use> statement, $evaltext contains the text of the C<eval EXPR> statement.
es_es: En tal caso, se añaden los nuevos elementos $evaltext y C<$is_require>: C<$is_require> es verdadero si el marco es creado por una instrucción C<require> o C<use>, $evaltext contiene el texto de la instrucción C<eval EXPR>.

source: $first = <$handle> or return (); # Automatically closed here.
es_es: $first = <$handle> or return (); # Cerrado aquí automáticamente.

source: Note the LIST is prepended whole, not one element at a time, so the prepended elements stay in the same order.
es_es: Note que la LISTA se antepone en su conjunto, no un elemento a la vez, por lo que los elementos añadidos se mantienen en el mismo orden.
